In [4]:
import pandas as pd 
import numpy as np
dates = pd.date_range('1/1/2000', periods=8)
df = pd.DataFrame(np.random.randn(8,4),index=dates,columns=['A','B','C','D'])

In [5]:
df

                   A         B         C         D
2000-01-01 -2.033616  0.590110 -1.267866  0.468434
2000-01-02 -0.491436 -0.672137  0.581293 -2.000479
2000-01-03  1.441162 -1.507751  0.903715  2.693086
2000-01-04 -0.481911  0.939288  0.741415  1.182885
2000-01-05 -1.681127  1.997605  2.062116  0.889734
2000-01-06  1.346646 -0.256601 -0.324408 -1.831734
2000-01-07  0.965447  0.755166  0.764875 -1.569953
2000-01-08  1.196921 -0.824111  1.459327  0.460776

In [6]:
s = df['A']
s[dates[5]]

1.346645928568106

In [7]:
df[['B',"A"]]=df[['A',"B"]]
df

                   A         B         C         D
2000-01-01  0.590110 -2.033616 -1.267866  0.468434
2000-01-02 -0.672137 -0.491436  0.581293 -2.000479
2000-01-03 -1.507751  1.441162  0.903715  2.693086
2000-01-04  0.939288 -0.481911  0.741415  1.182885
2000-01-05  1.997605 -1.681127  2.062116  0.889734
2000-01-06 -0.256601  1.346646 -0.324408 -1.831734
2000-01-07  0.755166  0.965447  0.764875 -1.569953
2000-01-08 -0.824111  1.196921  1.459327  0.460776

In [8]:
df.loc[:,['B','A']]=df[['A',"B"]].to_numpy()

In [11]:
sa = pd.Series([1, 2, 3], index=list('abc'))
dfa = df.copy()

In [17]:
dfa.A = list(range(len(dfa.index)))
dfa

            A         B         C         D
2000-01-01  0  0.590110 -1.267866  0.468434
2000-01-02  1 -0.672137  0.581293 -2.000479
2000-01-03  2 -1.507751  0.903715  2.693086
2000-01-04  3  0.939288  0.741415  1.182885
2000-01-05  4  1.997605  2.062116  0.889734
2000-01-06  5 -0.256601 -0.324408 -1.831734
2000-01-07  6  0.755166  0.764875 -1.569953
2000-01-08  7 -0.824111  1.459327  0.460776

In [20]:
s1 = pd.Series(np.random.randn(6), index=list('abcdef'))
s1.loc['c':]=0
s1

a    2.247463
b    0.106085
c    0.000000
d    0.000000
e    0.000000
f    0.000000
dtype: float64

In [21]:
df1 = pd.DataFrame(np.random.randn(6,4), index=list('abcdef'), columns=list('ABCD'))
df1

          A         B         C         D
a  0.020158 -0.352322  0.689952 -0.330492
b  0.600158 -1.166005  0.687418 -1.254519
c  0.663653 -0.629888  0.101208  0.060246
d  1.867378  0.050444 -0.475744  0.367981
e -2.122147  0.813155  1.230378  0.067822
f -0.145773 -1.082781 -2.085443 -1.212195

In [23]:
df1.loc[lambda df:df.A>0,:]
df1.loc[:, lambda df: ['A', 'B']]

          A         B
a  0.020158 -0.352322
b  0.600158 -1.166005
c  0.663653 -0.629888
d  1.867378  0.050444
e -2.122147  0.813155
f -0.145773 -1.082781

In [24]:
df1.A.loc[lambda s: s > 0]

a    0.020158
b    0.600158
c    0.663653
d    1.867378
Name: A, dtype: float64

In [27]:
s = pd.Series([1, 2, 3])
s.loc[[1,2]]

1    2
2    3
dtype: int64

In [28]:
s

0    1
1    2
2    3
dtype: int64

In [29]:
df1

          A         B         C         D
a  0.020158 -0.352322  0.689952 -0.330492
b  0.600158 -1.166005  0.687418 -1.254519
c  0.663653 -0.629888  0.101208  0.060246
d  1.867378  0.050444 -0.475744  0.367981
e -2.122147  0.813155  1.230378  0.067822
f -0.145773 -1.082781 -2.085443 -1.212195

In [36]:
df1.at["a", 'A']

0.02015821177949277

In [40]:
df1.iat[0,0]=1
df1

          A         B         C         D
a  1.000000 -0.352322  0.689952 -0.330492
b  0.600158 -1.166005  0.687418 -1.254519
c  0.663653 -0.629888  0.101208  0.060246
d  1.867378  0.050444 -0.475744  0.367981
e -2.122147  0.813155  1.230378  0.067822
f -0.145773 -1.082781 -2.085443 -1.212195

In [42]:
s = pd.Series(range(-3, 4))
s[s>0]

4    1
5    2
6    3
dtype: int64

In [43]:
df2 = pd.DataFrame({'a': ['one', 'one', 'two', 'three', 'two', 'one', 'six'],
                    'b': ['x', 'y', 'y', 'x', 'y', 'x', 'x'],
                    'c': np.random.randn(7)})
df2

       a  b         c
0    one  x  2.071634
1    one  y  0.579799
2    two  y -1.008128
3  three  x  0.377423
4    two  y -2.427651
5    one  x -0.056673
6    six  x  0.720097

In [44]:
criterion = df2.a.map(lambda x: x.startswith('t'))
df2[criterion]

       a  b         c
2    two  y -1.008128
3  three  x  0.377423
4    two  y -2.427651

In [45]:
s = pd.Series(np.arange(5), index=np.arange(5)[::-1], dtype='int64')
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [49]:
s[s.index.isin([2, 4, 6])]

4    0
2    2
dtype: int64

In [50]:
s_mi = pd.Series(np.arange(6),
                 index=pd.MultiIndex.from_product([[0, 1], ['a', 'b', 'c']]))
s_mi

0  a    0
   b    1
   c    2
1  a    3
   b    4
   c    5
dtype: int64

In [51]:
s_mi.iloc[s_mi.index.isin([(1, 'a'), (2, 'b'), (0, 'c')])]

0  c    2
1  a    3
dtype: int64

In [53]:
df = pd.DataFrame({'vals': [1, 2, 3, 4], 'ids': ['a', 'b', 'f', 'n'],
                   'ids2': ['a', 'n', 'c', 'n']})
values = ['a','b',1,3]
df.isin(values)

    vals    ids   ids2
0   True   True   True
1  False   True  False
2   True  False  False
3  False  False  False

In [54]:
df

   vals ids ids2
0     1   a    a
1     2   b    n
2     3   f    c
3     4   n    n

In [56]:
s[s>0]
s.where(s>0)

4    NaN
3    1.0
2    2.0
1    3.0
0    4.0
dtype: float64

In [60]:
n=10
df = pd.DataFrame(np.random.rand(n, 3), columns=list('abc'))

          a         b         c
0  0.746994  0.205805  0.317142
1  0.837283  0.101014  0.755946
2  0.237056  0.963740  0.760783
3  0.676454  0.631011  0.001535
4  0.446084  0.065321  0.097781
5  0.672849  0.128064  0.408622
6  0.759413  0.335980  0.100126
7  0.964642  0.946787  0.425646
8  0.312511  0.500502  0.087536
9  0.294660  0.416315  0.586343

In [ ]:
df[(df.a)]

In [61]:
n = 10
df = pd.DataFrame(np.random.rand(n, 3), columns=list('abc'))
df.head()

          a         b         c
0  0.533479  0.808377  0.765146
1  0.088867  0.938595  0.669068
2  0.505344  0.124212  0.432521
3  0.199213  0.068024  0.999168
4  0.900293  0.617827  0.274812

In [64]:
df[(df.a < df.b) & (df.b < df.c)]
df.query('(a<b)&(b<c)')

Empty DataFrame
Columns: [a, b, c]
Index: []